# Brew formulas
brew "git"
brew "gh"
brew "fnm"
brew "bat"
brew "eza"
brew "fzf"
brew "ripgrep"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks
cask "orbstack" # Docker substitute
cask "google-chrome"
cask "visual-studio-code"
cask "spotify"
cask "font-hackgen-nerd"
cask "vivaldi"
cask "line"
